# pandas Basics

In [1]:
import pandas as pd

## 1. Create DataFrame

In [2]:
data = {
    'BlackCoffee': [250, 203, 189, 216, 197], 
    'Latte': [150, 139, 210, 144, 186],
    'ChaiLatte': [143, 182, 166, 172, 102],
    'Mocha': [82, 130, 122, 99, 103],
    'HotChocolate': [87, 90, 95, 119, 107] 
}
purchases = pd.DataFrame(data, index=['June', 'July', 'August', 'September', 'October'])
purchases

           BlackCoffee  ChaiLatte  HotChocolate  Latte  Mocha
June               250        143            87    150     82
July               203        182            90    139    130
August             189        166            95    210    122
September          216        172           119    144     99
October            197        102           107    186    103

In [3]:
purchases.index

Index(['June', 'July', 'August', 'September', 'October'], dtype='object')

In [4]:
purchases.columns

Index(['BlackCoffee', 'ChaiLatte', 'HotChocolate', 'Latte', 'Mocha'], dtype='object')

In [5]:
purchases['Latte']

June         150
July         139
August       210
September    144
October      186
Name: Latte, dtype: int64

In [6]:
purchases.loc['September']

BlackCoffee     216
ChaiLatte       172
HotChocolate    119
Latte           144
Mocha            99
Name: September, dtype: int64

In [7]:
purchases.iloc[3]

BlackCoffee     216
ChaiLatte       172
HotChocolate    119
Latte           144
Mocha            99
Name: September, dtype: int64

In [8]:
purchases[1:4]

           BlackCoffee  ChaiLatte  HotChocolate  Latte  Mocha
July               203        182            90    139    130
August             189        166            95    210    122
September          216        172           119    144     99

In [9]:
purchases.loc['July':'September']

           BlackCoffee  ChaiLatte  HotChocolate  Latte  Mocha
July               203        182            90    139    130
August             189        166            95    210    122
September          216        172           119    144     99

In [10]:
purchases.iloc[1:4]

           BlackCoffee  ChaiLatte  HotChocolate  Latte  Mocha
July               203        182            90    139    130
August             189        166            95    210    122
September          216        172           119    144     99

In [11]:
purchases.loc[:, 'BlackCoffee':'HotChocolate']

           BlackCoffee  ChaiLatte  HotChocolate
June               250        143            87
July               203        182            90
August             189        166            95
September          216        172           119
October            197        102           107

In [12]:
purchases.loc['July':'September', 'BlackCoffee':'ChaiLatte']

           BlackCoffee  ChaiLatte
July               203        182
August             189        166
September          216        172

In [13]:
purchases.iloc[1:4, 0:2]

           BlackCoffee  ChaiLatte
July               203        182
August             189        166
September          216        172

In [14]:
purchases[purchases['BlackCoffee'] > 200]

           BlackCoffee  ChaiLatte  HotChocolate  Latte  Mocha
June               250        143            87    150     82
July               203        182            90    139    130
September          216        172           119    144     99

In [15]:
purchases[(purchases['BlackCoffee'] > 200) & (purchases['HotChocolate'] > 100)]

           BlackCoffee  ChaiLatte  HotChocolate  Latte  Mocha
September          216        172           119    144     99

In [16]:
purchases[(purchases['BlackCoffee'] > 200) | (purchases['HotChocolate'] > 100)]

           BlackCoffee  ChaiLatte  HotChocolate  Latte  Mocha
June               250        143            87    150     82
July               203        182            90    139    130
September          216        172           119    144     99
October            197        102           107    186    103

In [17]:
purchases.query('BlackCoffee > 200')

           BlackCoffee  ChaiLatte  HotChocolate  Latte  Mocha
June               250        143            87    150     82
July               203        182            90    139    130
September          216        172           119    144     99

In [18]:
purchases.query('BlackCoffee > 200 & HotChocolate > 100')

           BlackCoffee  ChaiLatte  HotChocolate  Latte  Mocha
September          216        172           119    144     99

In [19]:
purchases.query('BlackCoffee > Mocha * 2')

           BlackCoffee  ChaiLatte  HotChocolate  Latte  Mocha
June               250        143            87    150     82
September          216        172           119    144     99

## 2. Dealing with more than one DataFrames

### A. `pd.concat()`

In [20]:
df_1 = pd.DataFrame({
    'BlackCoffee': [222, 190, 213, 250, 203],
    'Latte': [198, 178, 157, 150, 139],
    'GreenTeaLatte': [113, 104, 99, 125, 100],
    'WhiteMocha': [130, 142, 110, 102, 106],
    'Espresso': [78, 70, 98, 66, 73]},
    index=['March', 'April', 'May', 'June', 'July'])

df_2 = pd.DataFrame({
    'BlackCoffee': [250, 203, 189, 216, 197], 
    'Latte': [150, 139, 210, 144, 186],
    'ChaiLatte': [143, 182, 166, 172, 102],
    'Mocha': [82, 130, 122, 99, 103],
    'HotChocolate': [87, 90, 95, 119, 107]},
    index=['June', 'July', 'August', 'September', 'October'])

In [21]:
df_1

       BlackCoffee  Espresso  GreenTeaLatte  Latte  WhiteMocha
March          222        78            113    198         130
April          190        70            104    178         142
May            213        98             99    157         110
June           250        66            125    150         102
July           203        73            100    139         106

In [22]:
df_2

           BlackCoffee  ChaiLatte  HotChocolate  Latte  Mocha
June               250        143            87    150     82
July               203        182            90    139    130
August             189        166            95    210    122
September          216        172           119    144     99
October            197        102           107    186    103

In [23]:
pd.concat([df_1, df_2])

,BlackCoffee,ChaiLatte,Espresso,GreenTeaLatte,HotChocolate,Latte,Mocha,WhiteMocha
March,222,NaN,78.0,113.0,NaN,198,NaN,130.0
April,190,NaN,70.0,104.0,NaN,178,NaN,142.0
May,213,NaN,98.0,99.0,NaN,157,NaN,110.0
June,250,NaN,66.0,125.0,NaN,150,NaN,102.0
July,203,NaN,73.0,100.0,NaN,139,NaN,106.0
June,250,143.0,NaN,NaN,87.0,150,82.0,NaN
July,203,182.0,NaN,NaN,90.0,139,130.0,NaN
August,189,166.0,NaN,NaN,95.0,210,122.0,NaN
September,216,172.0,NaN,NaN,119.0,144,99.0,NaN
October,197,102.0,NaN,NaN,107.0,186,103.0,NaN

In [24]:
pd.concat([df_1, df_2], keys=['df_1', 'df_2'])

                BlackCoffee  ChaiLatte  Espresso  GreenTeaLatte  HotChocolate  \
df_1 March              222        NaN      78.0          113.0           NaN
     April              190        NaN      70.0          104.0           NaN
     May                213        NaN      98.0           99.0           NaN
     June               250        NaN      66.0          125.0           NaN
     July               203        NaN      73.0          100.0           NaN
df_2 June               250      143.0       NaN            NaN          87.0
     July               203      182.0       NaN            NaN          90.0
     August             189      166.0       NaN            NaN          95.0
     September          216      172.0       NaN            NaN         119.0
     October            197      102.0       NaN            NaN         107.0

                Latte  Mocha  WhiteMocha
df_1 March        198    NaN       130.0
     April        178    NaN       142.0
     May          157    NaN       110.0
     June         150    NaN       102.0
     July         139    NaN       106.0
df_2 June         150   82.0         NaN
     July         139  130.0         NaN
     August       210  122.0         NaN
     September    144   99.0         NaN
     October      186  103.0         NaN

In [25]:
pd.concat([df_1, df_2], join='inner')

           BlackCoffee  Latte
March              222    198
April              190    178
May                213    157
June               250    150
July               203    139
June               250    150
July               203    139
August             189    210
September          216    144
October            197    186

In [26]:
pd.concat([df_1, df_2], axis=1)

,BlackCoffee,Espresso,GreenTeaLatte,Latte,WhiteMocha,BlackCoffee,ChaiLatte,HotChocolate,Latte,Mocha
April,190.0,70.0,104.0,178.0,142.0,NaN,NaN,NaN,NaN,NaN
August,NaN,NaN,NaN,NaN,NaN,189.0,166.0,95.0,210.0,122.0
July,203.0,73.0,100.0,139.0,106.0,203.0,182.0,90.0,139.0,130.0
June,250.0,66.0,125.0,150.0,102.0,250.0,143.0,87.0,150.0,82.0
March,222.0,78.0,113.0,198.0,130.0,NaN,NaN,NaN,NaN,NaN
May,213.0,98.0,99.0,157.0,110.0,NaN,NaN,NaN,NaN,NaN
October,NaN,NaN,NaN,NaN,NaN,197.0,102.0,107.0,186.0,103.0
September,NaN,NaN,NaN,NaN,NaN,216.0,172.0,119.0,144.0,99.0

In [27]:
pd.concat([df_1, df_2], join='inner', axis=1)

,BlackCoffee,Espresso,GreenTeaLatte,Latte,WhiteMocha,BlackCoffee,ChaiLatte,HotChocolate,Latte,Mocha
June,250,66,125,150,102,250,143,87,150,82
July,203,73,100,139,106,203,182,90,139,130

### B. `DataFrame.append()`

In [28]:
# Same as 'pd.concat([df_1, df_2])'
df_1.append(df_2)

,BlackCoffee,ChaiLatte,Espresso,GreenTeaLatte,HotChocolate,Latte,Mocha,WhiteMocha
March,222,NaN,78.0,113.0,NaN,198,NaN,130.0
April,190,NaN,70.0,104.0,NaN,178,NaN,142.0
May,213,NaN,98.0,99.0,NaN,157,NaN,110.0
June,250,NaN,66.0,125.0,NaN,150,NaN,102.0
July,203,NaN,73.0,100.0,NaN,139,NaN,106.0
June,250,143.0,NaN,NaN,87.0,150,82.0,NaN
July,203,182.0,NaN,NaN,90.0,139,130.0,NaN
August,189,166.0,NaN,NaN,95.0,210,122.0,NaN
September,216,172.0,NaN,NaN,119.0,144,99.0,NaN
October,197,102.0,NaN,NaN,107.0,186,103.0,NaN

### C. `pd.merge()`

In [29]:
df_3 = pd.DataFrame({
    'country': ['Japan', 'France', 'USA'],
    'population': [13800000, 2140000, 700000],
    'capital?': ['Yes', 'Yes', 'No']},
    index=['Tokyo', 'Paris', 'Boston'])

In [30]:
df_4 = pd.DataFrame({
    'country': ['Japan', 'USA', 'Switzerland'],
    'capital?': ['No', 'N', 'No'],
    'language': ['Japanese', 'English', 'French']},
    index=['Kyoto', 'NewYork', 'Geneva'])

In [31]:
df_3

       capital? country  population
Tokyo       Yes   Japan    13800000
Paris       Yes  France     2140000
Boston       No     USA      700000

In [32]:
df_4

        capital?      country  language
Kyoto         No        Japan  Japanese
NewYork        N          USA   English
Geneva        No  Switzerland    French

In [33]:
pd.merge(df_3, df_4, on='country', indicator=True)

  capital?_x country  population capital?_y  language _merge
0        Yes   Japan    13800000         No  Japanese   both
1         No     USA      700000          N   English   both

In [34]:
pd.merge(df_3, df_4, on=['country'], how='outer', indicator=True)

  capital?_x      country  population capital?_y  language      _merge
0        Yes        Japan  13800000.0         No  Japanese        both
1        Yes       France   2140000.0        NaN       NaN   left_only
2         No          USA    700000.0          N   English        both
3        NaN  Switzerland         NaN         No    French  right_only

In [35]:
pd.merge(df_3, df_4, on='country', how='left', indicator=True)

  capital?_x country  population capital?_y  language     _merge
0        Yes   Japan    13800000         No  Japanese       both
1        Yes  France     2140000        NaN       NaN  left_only
2         No     USA      700000          N   English       both

In [36]:
pd.merge(df_3, df_4, on='country', how='right', indicator=True)

  capital?_x      country  population capital?_y  language      _merge
0        Yes        Japan  13800000.0         No  Japanese        both
1         No          USA    700000.0          N   English        both
2        NaN  Switzerland         NaN         No    French  right_only

### D. `DataFrame.join()`

In [37]:
df_5 = pd.DataFrame({
    'name': ['A', 'B', 'C'],
    'email': ['a@sample.com', 'b@sample.com', 'c@sample.com'],
    'gender': ['Male', 'Female', 'Female']},
    index=['User1', 'User2', 'User3'])

In [38]:
df_6 = pd.DataFrame({
    'age': [27, 22, 31],
    'Number of friends': [290, 310, 480]},
    index=['User1', 'User2', 'User4'])

In [39]:
df_5

              email  gender name
User1  a@sample.com    Male    A
User2  b@sample.com  Female    B
User3  c@sample.com  Female    C

In [40]:
df_6

       Number of friends  age
User1                290   27
User2                310   22
User4                480   31

In [41]:
df_5.join(df_6)

              email  gender name  Number of friends   age
User1  a@sample.com    Male    A              290.0  27.0
User2  b@sample.com  Female    B              310.0  22.0
User3  c@sample.com  Female    C                NaN   NaN

In [42]:
df_5.join(df_6, how='right')

              email  gender name  Number of friends  age
User1  a@sample.com    Male    A                290   27
User2  b@sample.com  Female    B                310   22
User4           NaN     NaN  NaN                480   31

In [43]:
df_5.join(df_6, how='inner')

              email  gender name  Number of friends  age
User1  a@sample.com    Male    A                290   27
User2  b@sample.com  Female    B                310   22

In [44]:
df_5.join(df_6, how='outer')

              email  gender name  Number of friends   age
User1  a@sample.com    Male    A              290.0  27.0
User2  b@sample.com  Female    B              310.0  22.0
User3  c@sample.com  Female    C                NaN   NaN
User4           NaN     NaN  NaN              480.0  31.0